# St7GetResultFreedomCaseName

Returns the name of the freedom case in the result file currently open.

long St7GetResultFreedomCaseName(long uID, char* CaseName, long MaxStringLen)
Input Parameters
uID
Strand7 model file ID.
MaxStringLen
Maximum number of characters allocated for CaseName.
Output Parameters
CaseName
Result freedom case name.
Applicability
Applicable to all solver types.